lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaOnOffLightJoinable/ZigbeeHaOnOffLightJoinable.ino
#include <Arduino.h>
#include <string.h>

#include "nrf54l15_hal.h"
#include "zigbee_commissioning.h"
#include "zigbee_persistence.h"
#include "zigbee_security.h"
#include "zigbee_stack.h"

#if defined(NRF54L15_CLEAN_ZIGBEE_ENABLED) && (NRF54L15_CLEAN_ZIGBEE_ENABLED == 0)
#error "Enable Tools > Zigbee Support to build ZigbeeHaOnOffLightJoinable."
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_CHANNEL
#define NRF54L15_CLEAN_ZIGBEE_CHANNEL 15
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_PAN_ID
#define NRF54L15_CLEAN_ZIGBEE_PAN_ID 0x1234
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_PRIMARY_CHANNEL_MASK
#define NRF54L15_CLEAN_ZIGBEE_PRIMARY_CHANNEL_MASK 0x07FFF800UL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_SECONDARY_CHANNEL_MASK
#define NRF54L15_CLEAN_ZIGBEE_SECONDARY_CHANNEL_MASK 0U
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_USE_INSTALL_CODE
#define NRF54L15_CLEAN_ZIGBEE_USE_INSTALL_CODE 1
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_ALLOW_WELL_KNOWN_LINK_KEY
#define NRF54L15_CLEAN_ZIGBEE_ALLOW_WELL_KNOWN_LINK_KEY 1
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_REQUIRE_ENCRYPTED_TRANSPORT_KEY
#define NRF54L15_CLEAN_ZIGBEE_REQUIRE_ENCRYPTED_TRANSPORT_KEY 1
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_ALLOW_DEMO_PLAINTEXT_TC_CMDS
#define NRF54L15_CLEAN_ZIGBEE_ALLOW_DEMO_PLAINTEXT_TC_CMDS 0
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_TRUST_CENTER_IEEE
#define NRF54L15_CLEAN_ZIGBEE_TRUST_CENTER_IEEE 0ULL
#endif

using namespace xiao_nrf54l15;

namespace {

static ZigbeeRadio g_radio;
static ZigbeeHomeAutomationDevice g_device;
static ZigbeePersistentStateStore g_store;

static uint8_t g_macSequence = 1U;
static ZigbeeEndDeviceCommonState g_network{};
static uint8_t& g_nwkSequence = g_network.nwkSequence;
static uint32_t& g_nwkSecurityFrameCounter = g_network.nwkSecurityFrameCounter;
static uint32_t& g_lastInboundSecurityFrameCounter =
    g_network.incomingNwkFrameCounter;
static uint32_t& g_lastInboundApsFrameCounter =
    g_network.incomingApsFrameCounter;
static uint8_t& g_apsCounter = g_network.apsCounter;
static uint8_t g_zclSequence = 1U;
static uint32_t& g_lastJoinAttemptMs = g_network.lastJoinAttemptMs;
static uint32_t g_lastStatusMs = 0U;
static uint32_t g_lastPollMs = 0U;
static uint32_t g_lastReportMs[8] = {0U};
static uint8_t (&g_activeNetworkKey)[16] = g_network.activeNetworkKey;
static uint8_t& g_activeNetworkKeySequence = g_network.activeNetworkKeySequence;
static uint8_t (&g_alternateNetworkKey)[16] = g_network.alternateNetworkKey;
static uint8_t& g_alternateNetworkKeySequence =
    g_network.alternateNetworkKeySequence;
static bool& g_joined = g_network.joined;
static bool& g_rejoinPending = g_network.rejoinPending;
static bool& g_securityEnabled = g_network.securityEnabled;
static bool& g_haveActiveNetworkKey = g_network.haveActiveNetworkKey;
static bool& g_haveAlternateNetworkKey = g_network.haveAlternateNetworkKey;
static bool g_savedOnOffState = false;
static uint64_t& g_trustCenterIeee = g_network.trustCenterIeee;
static ZigbeePreconfiguredKeyMode& g_preconfiguredKeyMode =
    g_network.preconfiguredKeyMode;

static ZigbeePersistentState g_restoredState{};
static bool g_haveRestoredState = false;

static constexpr uint8_t kPreferredChannel =
    static_cast<uint8_t>(NRF54L15_CLEAN_ZIGBEE_CHANNEL);
static constexpr uint16_t kPreferredPanId =
    static_cast<uint16_t>(NRF54L15_CLEAN_ZIGBEE_PAN_ID);
static constexpr uint16_t kCoordinatorShort = 0x0000U;
static constexpr uint16_t kTempShort = 0x7E01U;
static constexpr uint8_t kLocalEndpoint = 1U;
static constexpr uint8_t kCoordinatorEndpoint = 1U;
static constexpr uint64_t kIeeeAddress = 0x00124B0001AC1001ULL;
static constexpr uint8_t kStateFlagJoined = 0x01U;
static constexpr uint8_t kStateFlagSecurityEnabled = 0x02U;
static const uint8_t kInstallCode[18] = {
    0x10U, 0xACU, 0x01U, 0x01U, 0x24U, 0x4BU, 0x00U, 0xA1U, 0xB2U,
    0xC3U, 0xD4U, 0xE5U, 0xF6U, 0x07U, 0x18U, 0x29U, 0x43U, 0x6AU};

static uint8_t& g_channel = g_network.channel;
static uint16_t& g_panId = g_network.panId;
static uint16_t& g_localShort = g_network.localShort;
static uint16_t& g_parentShort = g_network.parentShort;
static uint64_t& g_extendedPanId = g_network.extendedPanId;

struct ScanResult {
  bool valid = false;
  uint8_t channel = 0U;
  int8_t rssiDbm = -127;
  int16_t score = 0;
  ZigbeeMacBeaconView beacon{};
};

struct PendingApsAck {
  bool active = false;
  uint8_t counter = 0U;
  uint16_t clusterId = 0U;
  uint16_t profileId = 0U;
  uint8_t destinationEndpoint = 0U;
  uint8_t sourceEndpoint = 0U;
  uint32_t deadlineMs = 0U;
};

static PendingApsAck g_pendingApsAck{};
static constexpr uint32_t kApsAckTimeoutMs = 900U;

ZigbeeCommissioningPolicy commissioningPolicy() {
  ZigbeeCommissioningPolicy policy{};
  policy.primaryChannelMask =
      static_cast<uint32_t>(NRF54L15_CLEAN_ZIGBEE_PRIMARY_CHANNEL_MASK);
  policy.secondaryChannelMask =
      static_cast<uint32_t>(NRF54L15_CLEAN_ZIGBEE_SECONDARY_CHANNEL_MASK);
  policy.preferredPanId = kPreferredPanId;
  policy.preferredExtendedPanId = g_extendedPanId;
  policy.pinnedTrustCenterIeee =
      static_cast<uint64_t>(NRF54L15_CLEAN_ZIGBEE_TRUST_CENTER_IEEE);
  policy.allowWellKnownKey = (NRF54L15_CLEAN_ZIGBEE_ALLOW_WELL_KNOWN_LINK_KEY != 0);
  policy.allowInstallCodeKey = (NRF54L15_CLEAN_ZIGBEE_USE_INSTALL_CODE != 0);
  policy.installCodeOnly =
      (NRF54L15_CLEAN_ZIGBEE_USE_INSTALL_CODE != 0) &&
      (NRF54L15_CLEAN_ZIGBEE_ALLOW_WELL_KNOWN_LINK_KEY == 0);
  policy.requireEncryptedTransportKey =
      (NRF54L15_CLEAN_ZIGBEE_REQUIRE_ENCRYPTED_TRANSPORT_KEY != 0);
  policy.requireEncryptedUpdateDevice =
      (NRF54L15_CLEAN_ZIGBEE_ALLOW_DEMO_PLAINTEXT_TC_CMDS == 0);
  policy.requireEncryptedSwitchKey =
      (NRF54L15_CLEAN_ZIGBEE_ALLOW_DEMO_PLAINTEXT_TC_CMDS == 0);
  policy.requireUniqueTrustCenterForRejoin = true;
  return policy;
}

void refreshCommissioningState() {
  g_network.policy = commissioningPolicy();
  g_network.preferredChannel = kPreferredChannel;
  g_network.preferredPanId = kPreferredPanId;
  g_network.defaultShort = kTempShort;
  g_network.coordinatorShort = kCoordinatorShort;
}

