lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaOnOffLightJoinable/ZigbeeHaOnOffLightJoinable.ino
  uint8_t apsFrame[127] = {0U};
  uint8_t apsLength = 0U;
  if (!ZigbeeCodec::buildApsDataAcknowledgement(request, apsFrame,
                                                &apsLength)) {
    return false;
  }

  ZigbeeNetworkFrame nwk{};
  nwk.frameType = ZigbeeNwkFrameType::kData;
  nwk.securityEnabled = useSecurity;
  nwk.destinationShort = destinationShort;
  nwk.sourceShort = g_localShort;
  nwk.radius = 30U;
  nwk.sequence = g_nwkSequence++;

  uint8_t nwkFrame[127] = {0U};
  uint8_t nwkLength = 0U;
  if (useSecurity) {
    ZigbeeNwkSecurityHeader security{};
    security.valid = true;
    security.securityControl = kZigbeeSecurityControlNwkEncMic32;
    security.frameCounter = g_nwkSecurityFrameCounter++;
    security.sourceIeee = kIeeeAddress;
    security.keySequence = g_activeNetworkKeySequence;
    if (!ZigbeeSecurity::buildSecuredNwkFrame(nwk, security, g_activeNetworkKey,
                                              apsFrame, apsLength, nwkFrame,
                                              &nwkLength)) {
      return false;
    }
  } else if (!ZigbeeCodec::buildNwkFrame(nwk, apsFrame, apsLength, nwkFrame,
                                         &nwkLength)) {
    return false;
  }

  uint8_t psdu[127] = {0U};
  uint8_t psduLength = 0U;
  if (!ZigbeeRadio::buildDataFrameShort(g_macSequence++, g_panId,
                                        destinationShort, g_localShort, nwkFrame,
                                        nwkLength, psdu, &psduLength, false)) {
    return false;
  }

  return g_radio.transmit(psdu, psduLength, false, 1200000UL);
}

bool sendApsFrame(uint16_t destinationShort, uint8_t destinationEndpoint,
                  uint16_t clusterId, uint16_t profileId, uint8_t sourceEndpoint,
                  const uint8_t* payload, uint8_t payloadLength) {
  if (!g_joined) {
    return false;
  }
  const bool useSecurity = g_securityEnabled && g_haveActiveNetworkKey;

  ZigbeeApsDataFrame aps{};
  aps.frameType = ZigbeeApsFrameType::kData;
  aps.deliveryMode = kZigbeeApsDeliveryUnicast;
  aps.ackRequested = true;
  aps.destinationEndpoint = destinationEndpoint;
  aps.clusterId = clusterId;
  aps.profileId = profileId;
  aps.sourceEndpoint = sourceEndpoint;
  aps.counter = g_apsCounter++;

  uint8_t apsFrame[127] = {0U};
  uint8_t apsLength = 0U;
  if (!ZigbeeCodec::buildApsDataFrame(aps, payload, payloadLength, apsFrame,
                                      &apsLength)) {
    return false;
  }

  ZigbeeNetworkFrame nwk{};
  nwk.frameType = ZigbeeNwkFrameType::kData;
  nwk.securityEnabled = useSecurity;
  nwk.destinationShort = destinationShort;
  nwk.sourceShort = g_localShort;
  nwk.radius = 30U;
  nwk.sequence = g_nwkSequence++;

  uint8_t nwkFrame[127] = {0U};
  uint8_t nwkLength = 0U;
  if (useSecurity) {
    ZigbeeNwkSecurityHeader security{};
    security.valid = true;
    security.securityControl = kZigbeeSecurityControlNwkEncMic32;
    security.frameCounter = g_nwkSecurityFrameCounter++;
    security.sourceIeee = kIeeeAddress;
    security.keySequence = g_activeNetworkKeySequence;
    if (!ZigbeeSecurity::buildSecuredNwkFrame(nwk, security, g_activeNetworkKey,
                                              apsFrame, apsLength, nwkFrame,
                                              &nwkLength)) {
      return false;
    }
  } else if (!ZigbeeCodec::buildNwkFrame(nwk, apsFrame, apsLength, nwkFrame,
                                         &nwkLength)) {
    return false;
  }

  uint8_t psdu[127] = {0U};
  uint8_t psduLength = 0U;
  if (!ZigbeeRadio::buildDataFrameShort(g_macSequence++, g_panId,
                                        destinationShort, g_localShort, nwkFrame,
                                        nwkLength, psdu, &psduLength, false)) {
    return false;
  }

  const bool sent =
      g_radio.transmit(psdu, psduLength, false, 1200000UL);
  if (sent) {
    rememberPendingApsAck(aps);
  }
  return sent;
}

bool sendDeviceAnnounce() {
  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  if (!g_device.buildDeviceAnnounce(g_zclSequence++, payload, &payloadLength)) {
    return false;
  }
  return sendApsFrame(g_parentShort, 0U, kZigbeeZdoDeviceAnnounce,
                      kZigbeeProfileZdo, 0U, payload, payloadLength);
}

bool sendAttributeReport(uint16_t clusterId) {
  uint8_t zclFrame[127] = {0U};
  uint8_t zclLength = 0U;
  if (!g_device.buildAttributeReport(clusterId, g_zclSequence++, zclFrame,
                                     &zclLength) ||
      zclLength == 0U) {
    return false;
  }

  uint64_t destinationIeee = 0U;
  uint8_t destinationEndpoint = kCoordinatorEndpoint;
  if (g_device.resolveBindingDestination(kLocalEndpoint, clusterId,
                                         &destinationIeee,
                                         &destinationEndpoint) &&
      destinationEndpoint != 0U) {
    return sendApsFrame(g_parentShort, destinationEndpoint, clusterId,
                        kZigbeeProfileHomeAutomation, kLocalEndpoint, zclFrame,
                        zclLength);
  }
  return sendApsFrame(g_parentShort, kCoordinatorEndpoint, clusterId,
                      kZigbeeProfileHomeAutomation, kLocalEndpoint, zclFrame,
                      zclLength);
}

bool handleApsCommand(const uint8_t* frame, uint8_t length, uint16_t sourceShort,
                      uint64_t securedSourceIeee, bool nwkSecured) {
  refreshCommissioningState();

  uint8_t installCodeKey[16] = {0U};
  const bool haveInstallCodeKey = loadInstallCodeLinkKey(installCodeKey);
  ZigbeeTransportKeyInstallResult transportInstall{};
  if (ZigbeeCommissioning::acceptTransportKeyCommand(
          g_network, kIeeeAddress, frame, length, installCodeKey,
          haveInstallCodeKey, &transportInstall)) {
    ZigbeeCommissioning::applyTransportKeyInstall(&g_network, transportInstall);
    if (transportInstall.activatesNetworkKey) {
      g_lastInboundSecurityFrameCounter = 0U;
    }
    persistState();
    Serial.print(transportInstall.stagesAlternateKey ? "transport_key_update seq="
                                                     : "transport_key seq=");
    Serial.print(transportInstall.transportKey.keySequence);
    Serial.print(" install=");
    Serial.print(transportInstall.activatesNetworkKey ? "active" : "staged");
    Serial.print(" tc=0x");
    Serial.print(static_cast<uint32_t>(g_trustCenterIeee >> 32U), HEX);
    Serial.print(static_cast<uint32_t>(g_trustCenterIeee & 0xFFFFFFFFUL), HEX);
    Serial.print(" lk=");
    Serial.print(ZigbeeCommissioning::keyModeName(g_preconfiguredKeyMode));
    Serial.print(" ctr=");
    Serial.print(transportInstall.counter);
    if (transportInstall.apsSecurity.valid) {
      Serial.print(" aps_sec_fc=");
      Serial.print(transportInstall.apsSecurity.frameCounter);
    }
    Serial.print("\r\n");
    if (transportInstall.activatesNetworkKey) {
      (void)sendDeviceAnnounce();
    }
    return true;
  }

  ZigbeeUpdateDeviceAcceptance updateDevice{};
  if (ZigbeeCommissioning::acceptUpdateDeviceCommand(
          g_network, kIeeeAddress, sourceShort, securedSourceIeee, nwkSecured,
#if NRF54L15_CLEAN_ZIGBEE_ALLOW_DEMO_PLAINTEXT_TC_CMDS
          true,
#else
          false,
#endif
          frame, length, installCodeKey, haveInstallCodeKey, &updateDevice)) {
    ZigbeeCommissioning::applyUpdateDevice(&g_network, updateDevice);
    if (updateDevice.updateDevice.status ==
        kZigbeeApsUpdateDeviceStatusStandardSecureRejoin) {
      configureDeviceForCurrentNetwork();
      applyLedState();
      persistState();
    }
    Serial.print("update_device short=0x");
    Serial.print(updateDevice.updateDevice.deviceShort, HEX);
    Serial.print(" status=0x");
    Serial.print(updateDevice.updateDevice.status, HEX);
    Serial.print(" nwk_sec=");
    Serial.print(nwkSecured ? "1" : "0");
    if (updateDevice.apsSecurity.valid) {
      Serial.print(" aps_sec_fc=");
      Serial.print(updateDevice.apsSecurity.frameCounter);
    }
    Serial.print("\r\n");
    return true;
  }

  ZigbeeSwitchKeyAcceptance switchKey{};
  if (ZigbeeCommissioning::acceptSwitchKeyCommand(
          g_network, sourceShort, securedSourceIeee, nwkSecured, false, frame,
          length, installCodeKey, haveInstallCodeKey, &switchKey)) {
    ZigbeeCommissioning::applySwitchKey(&g_network, switchKey);
    g_lastInboundSecurityFrameCounter = 0U;
    configureDeviceForCurrentNetwork();
    applyLedState();
    persistState();
    Serial.print("switch_key seq=");
    Serial.print(g_activeNetworkKeySequence);
    Serial.print(" ctr=");
    Serial.print(switchKey.counter);
    if (switchKey.apsSecurity.valid) {
      Serial.print(" aps_sec_fc=");
      Serial.print(switchKey.apsSecurity.frameCounter);
    }
    Serial.print("\r\n");
    return true;
  }

